console.log('Самооценка' +
    'Ваша оценка - 153 балла \n' +
    'Отзыв по пунктам ТЗ:\n' +
    'Частично выполненные пункты:\n' +
    '1) тринадцать кнопок button (четыре из них в секции Video, пять в секции Tickets, по две - стрелки слайдера и плейлиста) \n' +
    'feedback: и еще 5 в форме контактов - 4 в полей number, закрытия модального окна, и отправки формы\n' +
    '\n' +
    '2) два тега input type="number"(в секции Tickets) \n' +
    'feedback: и еще два в модальной форме\n' +
    '3) вёрстка формы соответствует макету \n' +
    'feedback: Не закончена стилизация даты, времени и других компонентов формы\n' +
    'Выполненные пункты:\n' +
    '1) Вёрстка валидная. Для проверки валидности вёрстки используйте сервис https://validator.w3.org/. Валидной вёрстке соответствует надпись "Document checking completed. No errors or warnings to show." \n' +
    '\n' +
    '2) header, main, footer \n' +
    '\n' +
    '3) семь элементов section (по количеству секций) \n' +
    '\n' +
    '4) только один заголовок h1 \n' +
    '\n' +
    '5) семь заголовков h2 (по количеству секций) \n' +
    '\n' +
    '6) шесть заголовков h3 (по количеству карточек) \n' +
    '\n' +
    '7) два элемента nav (основная и вспомогательная панель навигации) \n' +
    '\n' +
    '8) три списка ul > li > a (основная и вспомогательная панель навигации, ссылки на соцсети) \n' +
    '\n' +
    '9) три тега input type="radio" (в секции Tickets) \n' +
    '\n' +
    '10) два тега input type="range" (громкось и прогрес-бар видео) \n' +
    '\n' +
    '11) для всех элементов img указан обязательный атрибут alt \n' +
    '\n' +
    '12) блок header \n' +
    '\n' +
    '13) секция Welcome \n' +
    '\n' +
    '14) секция Visiting \n' +
    '\n' +
    '15) секция Explore \n' +
    '\n' +
    '16) секция Video \n' +
    '\n' +
    '17) секция Gallery \n' +
    '\n' +
    '18) секция Tickets \n' +
    '\n' +
    '19) секция Contacts \n' +
    '\n' +
    '20) блок footer \n' +
    '\n' +
    '21) форма плавно выдвигается слева при открытии и плавно возвращается назад при закрытии. В открытом состоянии под формой есть полупрозрачный overlay, который занимает весь экран. Форма и overlay прокручиваются вместе со страницей \n' +
    '\n' +
    '22) форма открывается при клике по кнопке Buy Now в секции Tickets и закрывается кликом по иконке с крестиком в верхнем правом углу или кликом по overlay \n' +
    '\n' +
    '23) при вёрстке формы используются следующие элементы: form, input type="date", input type="time", input type="text", input type="email", input type="tel", input type="number", select \n' +
    '\n' +
    '24) добавлен favicon \n' +
    '\n' +
    '25) для построения сетки используются флексы или гриды \n' +
    '\n' +
    '26) при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону \n' +
    '\n' +
    '27) фоновый цвет каждого блока и секции тянется на всю ширину страницы \n' +
    '\n' +
    '28) иконки добавлены в формате .svg. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на способ добавления \n' +
    '\n' +
    '29) расстояние между буквами, там, где это требуется по макету, регулируется css-свойством letter-spacing \n' +
    '\n' +
    '30) переключаются радиокнопки в блоке Tickets, одновременно может быть выбрана только одна кнопка \n' +
    '\n' +
    '31) в блоке Contacts правильно указанны ссылки на почту mailto и на телефон tel \n' +
    '\n' +
    '32) в футере добавлены ссылки на соцсети. Круглая граница вокруг иконок соцсетей выполнена при помощи css \n' +
    '\n' +
    '33) плавная прокрутка по якорям \n' +
    '\n' +
    '34) параллакс \n' +
    '\n' +
    '35) при кликам по кнопке Discover the Louvre и карточкам секции Visiting открываются полноэкранные панорамы Google Street View встроенные в страницы вашего сайта при помощи iframe \n' +
    '\n' +
    '36) изменение стиля интерактивных элементов при наведении и клике. Интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer, но и другие визуальные эффекты – изменение цвета фона или шрифта, появление подчёркивания и т.д. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили, если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета \n' +
    '\n' +
    '37) обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы \n' +
    '\n' +
    '38) интерактивность при наведении карточек в секции Visiting предусматривает плавное растягивание подчёркивания заголовка карточки на всю ширину карточки \n' +
    '\n' +
    '39) интерактивность при наведении иконок социальных сетей в футере предусматривает изменение цвета иконки и круглой границы вокруг иконки на золотистый \n' +
    '\n' +
    '40) можно передвигать ползунки громкости и прогресс-бара видео, при этом цвет шкалы до и после ползунка отличается и соответствует макету \n' +
    '\n' +
    '41) кликами по кнопкам + и - в секции Tiskets можно менять количество билетов Basic и Senior от 0 до 20 \n' +
    '\n' +
    '42) кнопке "Book" в форме покупки билетов добавлен ripple-эффект. Демо: https://50projects50days.com/projects/button-ripple-effect/ \n' +
    '\n' +
    '43) при перезагрузке (обновлении) страницы картины в блоке Galery отображаются в рандомном порядке \n' +
    '\n')