console.log("Самооценка - 148 баллов \n" +
    "Отзыв по пунктам ТЗ:\n" +
    "Частично выполненные пункты:\n" +
    "1) Форма покупки билетов \n" +
    "\n" +
    "2) Форма покупки билетов \n" +
    "\n" +
    "3) Форма покупки билетов \n" +
    "\n" +
    "4) Блок footer  \n" +
    "\n" +
    "5) YouTube-видео в плейлисте в секции `Video`, маленькие видео выровнены по краям большого \n" +
    "\n" +
    "6) вёрстка меню соответствует макету на всех проверяемых разрешениях \n" +
    "\n" +
    "Выполненные пункты:\n" +
    "1) Блок header \n" +
    "\n" +
    "2) Секция Welcome \n" +
    "\n" +
    "3) Секция Visiting \n" +
    "\n" +
    "4) Секция Explore \n" +
    "\n" +
    "5) Секция Video \n" +
    "\n" +
    "6) Секция Gallery \n" +
    "\n" +
    "7) Секция Tickets \n" +
    "\n" +
    "8) Секция Contacts \n" +
    "\n" +
    "9) Блок footer  \n" +
    "\n" +
    "10) Блок header \n" +
    "\n" +
    "11) Секция Welcome \n" +
    "\n" +
    "12) Секция Visiting \n" +
    "\n" +
    "13) Секция Explore \n" +
    "\n" +
    "14) Секция Video \n" +
    "\n" +
    "15) Секция Gallery \n" +
    "\n" +
    "16) Секция Tickets \n" +
    "\n" +
    "17) Секция Contacts \n" +
    "\n" +
    "18) Блок footer  \n" +
    "\n" +
    "19) Блок header \n" +
    "\n" +
    "20) Секция Welcome \n" +
    "\n" +
    "21) Секция Visiting \n" +
    "\n" +
    "22) Секция Explore \n" +
    "\n" +
    "23) Секция Video \n" +
    "\n" +
    "24) Секция Gallery \n" +
    "\n" +
    "25) Секция Tickets \n" +
    "\n" +
    "26) Секция Contacts \n" +
    "\n" +
    "27) Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки,  элементы не должны скрываться, обрезаться, наезжать друг на друга, если это не предусмотрено макетом. \n" +
    "\n" +
    "28) слайдера в секции `Welcome` \n" +
    "\n" +
    "29) слайдера сравнения изображений в секции `Explore` \n" +
    "\n" +
    "30) кастомного видеоплеера в секции `Video` \n" +
    "\n" +
    "31) слайдера в секции `Video` \n" +
    "\n" +
    "32) галереи изображений и изображений в ней \n" +
    "\n" +
    "33) карты \n" +
    "\n" +
    "34) при нажатии на бургер-иконку меню появляется, плавно выдвигаясь слева, бургер-иконка изменяется на крестик. При нажатии на крестик меню исчезает, плавно возвращаясь назад, иконка крестика превращается в бургер-иконку \n" +
    "\n" +
    "35) ссылки в меню работают, обеспечивая плавную прокрутку по якорям \n" +
    "\n" +
    "36) при клике по ссылке в адаптивном меню, или при клике по любому месту сайта, кроме самого адаптивного меню, меню закрывается \n" +
    "\n" +
    "37) Результат проверки скорости сайта для мобильных устройств: 0 to 49 (red): Poor - не выполнено 0 ,баллов; 50 to 89 (orange): Needs Improvement - частично выполнено - 4 баллов; 90 to 100 (green): Good - выполнено полностью - 8 баллов \n" +
    "\n")